googlecontacts/src/test/resources/artifacts/ESB/config/requests/googlecontacts/esb_retrieveAllContactGroups_mandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:urn="wso2.connector.googlecontacts">
	<soapenv:Header></soapenv:Header>
	<soapenv:Body>
		<urn:retrieveAllContactGroups>
			<urn:appName>%s(appName)</urn:appName>
			<urn:userEmail>%s(userEmail)</urn:userEmail>
			<urn:accessToken>%s(accessToken)</urn:accessToken>
			<urn:method>retrieveAllContactGroups</urn:method>
		</urn:retrieveAllContactGroups>
	</soapenv:Body>
</soapenv:Envelope>